## Getting Started With Pandas

In [41]:
import numpy as np
import pandas as pd

In [42]:
# series - 1D labelled array
# dataframe - 2D labelled array

info = {
    "Name" : ["Rahul","Harshita","prash"],
    "CGPA" : [9.5,9.7,8.5]
}

df = pd.DataFrame(info)
df

       Name  CGPA
0     Rahul   9.5
1  Harshita   9.7
2     prash   8.5

***
## properties of Series
1. homogeneous - only one type of data is allowed, if entered an int in a grp of strings entire will be converted into object dataType
2. vectorised operations
3. Handle missing values with NAN
4. Mutable values , immutable values
***

In [43]:
s= pd.Series([1,2,3,4,5])
print(s)
print(type(s))
print(s.dtype) # int

s= pd.Series([1,2,3,4,5,"hii"])
print(s.dtype) # object

#index

print(s[0])
print(s[2])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
int64
object
1
3

In [44]:
# understanding Labels

age = pd.Series([45,23,16,33], index = ["adam","eve","bob","charlie"])
print(age)

print(age["adam"]) # labelled based access

print(age[0]) # index based access

# Access all index
print(age.index)

adam       45
eve        23
bob        16
charlie    33
dtype: int64
45
45
Index(['adam', 'eve', 'bob', 'charlie'], dtype='object')

/tmp/ipykernel_5413/4020251355.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(age[0]) # index based access

In [45]:
# vectorized operations
s1=pd.Series([1,2,3,4,5])
s2 = pd.Series([5,6,7,8,9])

print(s1+s2) 

# Mutable Values

s1[0] = 100
print(s1)

# Immutable Size

#s1.drop(1) # no change is s1
#print(s1)
changed_s1 = s1.drop(0)

print(s1)

print(changed_s1)

0     6
1     8
2    10
3    12
4    14
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

***
## Data Frame proerties
1. 
***

In [46]:
# creating dataframe using DICTIONARY

info = {
    "Name" : ["adam","eve","wai"],
    "Age" : [23,24,35],
    "GPA" : [9.5,8.4,7.8]
}

df = pd.DataFrame(info)
print(df , type(df))

print(df.index)#row values (prints nums in range if index not explicitly defined)
print(df.columns)

   Name  Age  GPA
0  adam   23  9.5
1   eve   24  8.4
2   wai   35  7.8 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'GPA'], dtype='object')

In [47]:
# creating Dataframe using LIST of LISTS

df = pd.DataFrame([["Adam",23],["eve",24],["wai",35]], columns = ["Name","age"])
df

   Name  age
0  Adam   23
1   eve   24
2   wai   35

In [48]:
# creating DataFrame using Numpy Arrays

np_arr= np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr,columns = ['a','b','c'])
df

   a  b  c
0  1  2  3
1  4  5  6

## Usage with CSV and JSON  files :

In [52]:
# CSV Files

df = pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [55]:
# JSON data

df = pd.read_json("employee-data.json")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [56]:
# for EXCEL-read_excel
# for SQL-read_sql

In [57]:
# DataFrame Methods

In [58]:
print(df.head()) # starting five rows if no valueis passed

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [61]:
df.tail() # last five rows if no value is passsed

   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [66]:
print(df.sample()) # random row from data if no value is passed 
print("-------")
df.sample(5) # for 5 rows

   ID   Name  Age Department  Salary
5   6  Frank   29    Finance   50000
-------

   ID     Name  Age Department  Salary
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
9  10    Julia   30    Finance   60000
5   6    Frank   29    Finance   50000
7   8   Hannah   26  Marketing   47000

In [67]:
print(df.info()) # provides some basic info about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes
None

In [70]:
df.shape # returns a tuple of (rows,col)

(10, 5)

In [71]:
df.describe() # gives summary of data

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [73]:
df.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [74]:
df.nunique() # no of unique rows

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64